[Killed] BlockStatement
src/demos.js:1:21
-function suma(a, b) {
-    //if(arguments.length !== suma.caller.arguments.length ) throw new Error("Error en los argumentos")
-    const result = +a + +b
-    if(isNaN(result))
-        throw new Error("No es un resultado numérico valido")
-    return +result.toPrecision(15);
-}
+function suma(a, b) {}
 function divide(a, b) {
     const result = a / b
killedBy: Ejemplos del curso Función Suma OK Suma dos entero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] UnaryOperator
src/demos.js:3:25
 function suma(a, b) {
     //if(arguments.length !== suma.caller.arguments.length ) throw new Error("Error en los argumentos")
-    const result = +a + +b
+    const result = +a + -b
     if(isNaN(result))
         throw new Error("No es un resultado numérico valido")
killedBy: Ejemplos del curso Función Suma OK Suma dos entero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArithmeticOperator
src/demos.js:3:20
 function suma(a, b) {
     //if(arguments.length !== suma.caller.arguments.length ) throw new Error("Error en los argumentos")
-    const result = +a + +b
+    const result = +a - +b
     if(isNaN(result))
         throw new Error("No es un resultado numérico valido")
killedBy: Ejemplos del curso Función Suma OK Suma dos entero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ConditionalExpression
src/demos.js:4:8
 function suma(a, b) {
     //if(arguments.length !== suma.caller.arguments.length ) throw new Error("Error en los argumentos")
     const result = +a + +b
-    if(isNaN(result))
+    if(false)
         throw new Error("No es un resultado numérico valido")
     return +result.toPrecision(15);
killedBy: Ejemplos del curso Función Suma KO Suma un solo numero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No es un resultado numérico"

Received function did not throw

[Killed] ConditionalExpression
src/demos.js:4:8
 function suma(a, b) {
     //if(arguments.length !== suma.caller.arguments.length ) throw new Error("Error en los argumentos")
     const result = +a + +b
-    if(isNaN(result))
+    if(true)
         throw new Error("No es un resultado numérico valido")
     return +result.toPrecision(15);
killedBy: Ejemplos del curso Función Suma OK Suma dos entero
statusReason: Error: No es un resultado numérico valido

[Killed] UnaryOperator
src/demos.js:6:12
     const result = +a + +b
     if(isNaN(result))
         throw new Error("No es un resultado numérico valido")
-    return +result.toPrecision(15);
+    return -result.toPrecision(15);
 }
 function divide(a, b) {
killedBy: Ejemplos del curso Función Suma OK Suma dos entero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3

[Killed] BlockStatement
src/demos.js:8:23
         throw new Error("No es un resultado numérico valido")
     return +result.toPrecision(15);
 }
-function divide(a, b) {
-    const result = a / b
-    if(isNaN(result) || !isFinite(result))
-         throw new Error("No es un resultado numérico valido")
-    return +result.toPrecision(15);
-}
+function divide(a, b) {}
 
 class Calculadora {
killedBy: Ejemplos del curso Función Divide OK Divide dos entero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: undefined

[Killed] ArithmeticOperator
src/demos.js:9:20
     return +result.toPrecision(15);
 }
 function divide(a, b) {
-    const result = a / b
+    const result = a * b
     if(isNaN(result) || !isFinite(result))
          throw new Error("No es un resultado numérico valido")
killedBy: Ejemplos del curso Función Divide OK Divide dos entero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: 2

[Killed] LogicalOperator
src/demos.js:10:8
 }
 function divide(a, b) {
     const result = a / b
-    if(isNaN(result) || !isFinite(result))
+    if(isNaN(result) && !isFinite(result))
          throw new Error("No es un resultado numérico valido")
     return +result.toPrecision(15);
killedBy: Ejemplos del curso Función Divide KO Divide por 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No es un resultado numérico"

Received function did not throw

[Killed] ConditionalExpression
src/demos.js:10:8
 }
 function divide(a, b) {
     const result = a / b
-    if(isNaN(result) || !isFinite(result))
+    if(true)
          throw new Error("No es un resultado numérico valido")
     return +result.toPrecision(15);
killedBy: Ejemplos del curso Función Divide OK Divide dos entero
statusReason: Error: No es un resultado numérico valido

[Killed] BlockStatement
src/demos.js:16:16
 }
 
 class Calculadora {
-    suma(a, b) {
-        //if(arguments.length !== suma.caller.arguments.length ) throw new Error("Error en los argumentos")
-        const result = +a + +b
-        if(isNaN(result))
-            throw new Error("No es un resultado numérico valido")
-        console.log(`------------------> ${result}`)
-        return +result.toPrecision(15);
-    }
+    suma(a, b) {}
     divide(a, b) {
         const result = a / b
killedBy: Ejemplos del curso Objeto Persona OK Pruebas de los métodos Integración: Método cumpleaños
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: undefined

[Killed] UnaryOperator
src/demos.js:18:24
 class Calculadora {
     suma(a, b) {
         //if(arguments.length !== suma.caller.arguments.length ) throw new Error("Error en los argumentos")
-        const result = +a + +b
+        const result = -a + +b
         if(isNaN(result))
             throw new Error("No es un resultado numérico valido")
killedBy: Ejemplos del curso Objeto Persona OK Pruebas de los métodos Integración: Método cumpleaños
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: -32

[Killed] UnaryOperator
src/demos.js:22:16
         if(isNaN(result))
             throw new Error("No es un resultado numérico valido")
         console.log(`------------------> ${result}`)
-        return +result.toPrecision(15);
+        return -result.toPrecision(15);
     }
     divide(a, b) {
killedBy: Ejemplos del curso Objeto Persona OK Pruebas de los métodos Integración: Método cumpleaños
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: -34

[NoCoverage] BlockStatement
src/demos.js:24:18
         console.log(`------------------> ${result}`)
         return +result.toPrecision(15);
     }
-    divide(a, b) {
-        const result = a / b
-        if(isNaN(result) || !isFinite(result))
-             throw new Error("No es un resultado numérico valido")
-        return +result.toPrecision(15);
-    }
+    divide(a, b) {}
 }
 

[NoCoverage] ArithmeticOperator
src/demos.js:25:24
         return +result.toPrecision(15);
     }
     divide(a, b) {
-        const result = a / b
+        const result = a * b
         if(isNaN(result) || !isFinite(result))
              throw new Error("No es un resultado numérico valido")

[NoCoverage] ConditionalExpression
src/demos.js:26:12
     }
     divide(a, b) {
         const result = a / b
-        if(isNaN(result) || !isFinite(result))
+        if(false)
              throw new Error("No es un resultado numérico valido")
         return +result.toPrecision(15);

[NoCoverage] BooleanLiteral
src/demos.js:26:29
     }
     divide(a, b) {
         const result = a / b
-        if(isNaN(result) || !isFinite(result))
+        if(isNaN(result) || isFinite(result))
              throw new Error("No es un resultado numérico valido")
         return +result.toPrecision(15);

[NoCoverage] StringLiteral
src/demos.js:27:30
     divide(a, b) {
         const result = a / b
         if(isNaN(result) || !isFinite(result))
-             throw new Error("No es un resultado numérico valido")
+             throw new Error("")
         return +result.toPrecision(15);
     }

[Killed] BlockStatement
src/demos.js:32:60
     }
 }
 
-function Persona(id, nombre, apellidos, edad, calculadora) {
-    let calc = calculadora ?? new Calculadora()
-    this.id = id
-    this.nombre = nombre
-    this.apellidos = apellidos
-    this.edad = +edad ? edad: 0 
-    this.nombreCompleto = () => this.nombre + ' ' + this.apellidos
-    this.cumpleaños = () => { this.edad = calc.suma(this.edad, 1) } // ++this.edad
-}
+function Persona(id, nombre, apellidos, edad, calculadora) {}
 
 module.exports = { suma, divide, Persona, Calculadora }
killedBy: Ejemplos del curso Objeto Persona OK Constructor
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "apellidos": "Grillo",
-   "id": 1,

[Killed] LogicalOperator
src/demos.js:33:16
 }
 
 function Persona(id, nombre, apellidos, edad, calculadora) {
-    let calc = calculadora ?? new Calculadora()
+    let calc = calculadora && new Calculadora()
     this.id = id
     this.nombre = nombre
killedBy: Ejemplos del curso Objeto Persona OK Pruebas de los métodos Unitaria: Método cumpleaños
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] UnaryOperator
src/demos.js:37:17
     this.id = id
     this.nombre = nombre
     this.apellidos = apellidos
-    this.edad = +edad ? edad: 0 
+    this.edad = -edad ? edad: 0 
     this.nombreCompleto = () => this.nombre + ' ' + this.apellidos
     this.cumpleaños = () => { this.edad = calc.suma(this.edad, 1) } // ++this.edad

[Killed] ArrowFunction
src/demos.js:38:27
     this.nombre = nombre
     this.apellidos = apellidos
     this.edad = +edad ? edad: 0 
-    this.nombreCompleto = () => this.nombre + ' ' + this.apellidos
+    this.nombreCompleto = () => undefined
     this.cumpleaños = () => { this.edad = calc.suma(this.edad, 1) } // ++this.edad
 }
killedBy: Ejemplos del curso Objeto Persona OK Pruebas de los métodos Método nombreCompleto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Pepito Grillo"
Received: undefined

[Killed] StringLiteral
src/demos.js:38:47
     this.nombre = nombre
     this.apellidos = apellidos
     this.edad = +edad ? edad: 0 
-    this.nombreCompleto = () => this.nombre + ' ' + this.apellidos
+    this.nombreCompleto = () => this.nombre + "" + this.apellidos
     this.cumpleaños = () => { this.edad = calc.suma(this.edad, 1) } // ++this.edad
 }
killedBy: Ejemplos del curso Objeto Persona OK Pruebas de los métodos Método nombreCompleto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Pepito Grillo"
Received: "PepitoGrillo"

[Killed] BlockStatement
src/demos.js:39:29
     this.apellidos = apellidos
     this.edad = +edad ? edad: 0 
     this.nombreCompleto = () => this.nombre + ' ' + this.apellidos
-    this.cumpleaños = () => { this.edad = calc.suma(this.edad, 1) } // ++this.edad
+    this.cumpleaños = () => {} // ++this.edad
 }
 
killedBy: Ejemplos del curso Objeto Persona OK Pruebas de los métodos Unitaria: Método cumpleaños
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: 33
