[Killed] BlockStatement
src/gilded_rose.js:15:115
   }
   updateQuality() {
     for (let i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-        if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
-              this.items[i].quality = this.items[i].quality - 1;
-            }
-            this.items[i].quality = this.items[i].quality - 1;
-          }
-        }
-      } else {
+      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {} else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 45
+ Received  + 45

@@ -2,21 +2,21 @@

[Killed] BlockStatement
src/gilded_rose.js:17:67
     for (let i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
-              this.items[i].quality = this.items[i].quality - 1;
-            }
-            this.items[i].quality = this.items[i].quality - 1;
-          }
+          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {}
         }
       } else {
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 45
+ Received  + 45

@@ -2,21 +2,21 @@

[Killed] EqualityOperator
src/gilded_rose.js:18:17
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
+            if (this.items[i].quality <= 1 && this.items[i].name == 'Conjured Mana Cake') {
               this.items[i].quality = this.items[i].quality - 1;
             }
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 3
+ Received  + 3

@@ -42,11 +42,11 @@

[Killed] ConditionalExpression
src/gilded_rose.js:18:17
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
+            if (false) {
               this.items[i].quality = this.items[i].quality - 1;
             }
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 3
+ Received  + 3

@@ -42,11 +42,11 @@

[Killed] ArithmeticOperator
src/gilded_rose.js:19:39
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
             if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
-              this.items[i].quality = this.items[i].quality - 1;
+              this.items[i].quality = this.items[i].quality + 1;
             }
             this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 5
+ Received  + 5

@@ -42,11 +42,11 @@

[Killed] ArithmeticOperator
src/gilded_rose.js:21:37
             if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
               this.items[i].quality = this.items[i].quality - 1;
             }
-            this.items[i].quality = this.items[i].quality - 1;
+            this.items[i].quality = this.items[i].quality + 1;
           }
         }
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 67
+ Received  + 67

@@ -2,21 +2,21 @@

[Killed] EqualityOperator
src/gilded_rose.js:27:15
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
+          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].sellIn < 11) {
               if (this.items[i].quality < 50) {
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 35
+ Received  + 35

@@ -7,11 +7,11 @@

[Killed] BlockStatement
src/gilded_rose.js:28:44
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
           if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
+            if (this.items[i].sellIn < 11) {}
             if (this.items[i].sellIn < 6) {
               if (this.items[i].quality < 50) {
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 10
+ Received  + 10

@@ -277,11 +277,11 @@

[Killed] BlockStatement
src/gilded_rose.js:44:37
       if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
-      if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
-                  this.items[i].quality = this.items[i].quality - 1;
-                }
-                this.items[i].quality = this.items[i].quality - 1;
-              }
-            }
-          } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality;
-          }
-        } else {
-          if (this.items[i].quality < 50) {
-            this.items[i].quality = this.items[i].quality + 1;
-          }
-        }
-      }
+      if (this.items[i].sellIn < 0) {}
     }
 
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 102
+ Received  + 102

@@ -107,11 +107,11 @@

[Killed] EqualityOperator
src/gilded_rose.js:45:13
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != 'Aged Brie') {
+        if (this.items[i].name == 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].quality > 0) {
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 167
+ Received  + 167

@@ -107,11 +107,11 @@

[Killed] BlockStatement
src/gilded_rose.js:46:82
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
-                  this.items[i].quality = this.items[i].quality - 1;
-                }
-                this.items[i].quality = this.items[i].quality - 1;
-              }
-            }
-          } else {
+          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {} else {
             this.items[i].quality = this.items[i].quality - this.items[i].quality;
           }
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 10
+ Received  + 10

@@ -262,11 +262,11 @@

[Killed] ConditionalExpression
src/gilded_rose.js:49:50
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].quality > 0) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
+                if (this.items[i].quality > 1 && true) {
                   this.items[i].quality = this.items[i].quality - 1;
                 }
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 4
+ Received  + 4

@@ -502,11 +502,11 @@

[Killed] ConditionalExpression
src/gilded_rose.js:49:21
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].quality > 0) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                if (this.items[i].quality > 1 && this.items[i].name == 'Conjured Mana Cake') {
+                if (true) {
                   this.items[i].quality = this.items[i].quality - 1;
                 }
killedBy: Gilded Rose instantánea
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose instantánea 1`

- Snapshot  - 30
+ Received  + 30

@@ -262,11 +262,11 @@
